[
  {
    "name": "The Web",
    "items": [
      {
        "name": "Phoenix Framework",
        "description": "Phoenix is a popular web development framework for building web applications with Elixir. Server-side rendering and real-time communication, are some of its key features. Has LiveView built-in, allowing developers to build interactive, real-time applications while writing little to no JavaScript.",
        "thumbnail": true,
        "url": "https://hexdocs.pm/phoenix/overview.html"
      },
      {
        "name": "Phoenix LiveView",
        "description": "LiveView is a library that enables rich, real-time user experiences with server-rendered HTML. It allows developers to build interactive, real-time applications while writing little to no JavaScript.",
        "thumbnail": false,
        "url": "https://hexdocs.pm/phoenix_live_view/welcome.html"
      },
      {
        "name": "SurfaceUI",
        "description": "A server-side rendering component library that allows developers to build rich interactive user-interfaces, writing minimal custom Javascript.",
        "thumbnail": true,
        "url": "https://hexdocs.pm/surface/Surface.html"
      },
      {
        "name": "LiveState",
        "description": "The goal of LiveState is to make highly interactive web applications easier to build. Currently, in most such applications, clients send requests and receive responses from and to a server API. This essentially results in two applications, with state being managed in both in an ad hoc way.\n\nLiveState uses a different approach. Clients dispatch events, which are sent to the server to be handled, and receive updates from the server any time application state changes. This allows state to have a single source of truth, and greatly reduces client code complexity. It also works equally well for applications where updates to state can occur independently from a user initiated, client side event (think \"real time\" applications such as chat, etc).",
        "thumbnail": false,
        "url": "https://hexdocs.pm/live_state/readme.html"
      },
      {
        "name": "Plug",
        "description": "A specification and composable modules for web application components, enabling HTTP request handling.",
        "thumbnail": false,
        "url": "https://hexdocs.pm/plug/readme.html"
      },
      {
        "name": "Absinthe",
        "description": "A GraphQL toolkit for Elixir, an implementation of the GraphQL specification built to suit the language's capabilities and idiomatic style",
        "thumbnail": true,
        "url": "https://hexdocs.pm/absinthe/overview.html"
      }
    ]
  },
  {
    "name": "Native Applications",
    "items": [
      {
        "name": "Scenic",
        "description": "Scenic is an application framework written directly on the Elixir/Erlang/OTP stack. With it, you can build client-side applications that operate identically across all supported operating systems, including MacOS, Ubuntu, Nerves/Linux, and more.",
        "thumbnail": true,
        "url": "https://hexdocs.pm/scenic/welcome.html"
      },
      {
        "name": "LiveView Native",
        "description": "LiveView Native allows you to build LiveView apps that have a front-end for multiple platforms. Use your LiveView back-end to create a web, mobile, wearable and/or desktop UI.",
        "thumbnail": true,
        "url": "https://hexdocs.pm/live_view_native/readme.html"
      }
    ]
  },
  {
    "name": "Machine Learning",
    "items": [
      {
        "name": "Nx",
        "description": "A multi-dimensional tensors library with multi-staged compilation to the CPU/GPU.",
        "thumbnail": true,
        "url": "https://hexdocs.pm/nx/intro-to-nx.html"
      },
      {
        "name": "Axon",
        "description": "Nx-powered Neural Networks for Elixir.",
        "thumbnail": true,
        "url": "https://hexdocs.pm/axon/Axon.html"
      },
      {
        "name": "Bumblebee",
        "description": "Pre-trained Neural Network models in Axon and integration with Hugging Face models",
        "thumbnail": false,
        "url": "https://hexdocs.pm/bumblebee/Bumblebee.html"
      },
      {
        "name": "Explorer",
        "description": "Explorer brings series (one-dimensional) and dataframes (two-dimensional) for fast data exploration to Elixir.",
        "thumbnail": true,
        "url": "https://hexdocs.pm/explorer/exploring_explorer.html"
      },
      {
        "name": "Scholar",
        "description": "Traditional machine learning tools built on top of Nx. Scholar implements several algorithms for classification, regression, clustering, dimensionality reduction, metrics, and preprocessing.",
        "thumbnail": true,
        "url": "https://hexdocs.pm/scholar/readme.html"
      }
    ]
  },
  {
    "name": "Embedded Software",
    "items": [
      {
        "name": "Nerves",
        "description": "A framework for building embedded software using Elixir, providing tools and libraries for hardware interfacing.",
        "thumbnail": true,
        "url": "https://hexdocs.pm/nerves/getting-started.html"
      }
    ]
  },
  {
    "name": "Database Tools",
    "items": [
      {
        "name": "Ecto",
        "description": "Ecto is a database wrapper and query generator for Elixir, providing a unified API for working with different databases.",
        "thumbnail": true,
        "url": "https://hexdocs.pm/ecto/Ecto.html"
      }
    ]
  },
  {
    "name": "Testing",
    "items": [
      {
        "name": "ExUnit",
        "description": "The built-in testing framework for Elixir, providing a simple and powerful API for writing and running tests.",
        "thumbnail": false,
        "url": "https://hexdocs.pm/ex_unit/ExUnit.html"
      },
      {
        "name": "Wallaby",
        "description": "A browser automation tool for Elixir, allowing developers to simulate realistic user interactions.",
        "thumbnail": true,
        "url": "https://hexdocs.pm/wallaby/readme.html"
      }
    ]
  },
  {
    "name": "Internationalization and Localization",
    "items": [
      {
        "name": "GetText",
        "description": "GetText is an internationalization and localization library for Elixir, allowing easy translation and formatting of messages.",
        "thumbnail": false,
        "url": "https://hexdocs.pm/gettext/Gettext.html"
      },
      {
        "name": "Elixir CLDR",
        "description": "A library for working with Unicode Common Locale Data Repository (CLDR) in Elixir applications.",
        "thumbnail": true,
        "url": "https://hexdocs.pm/ex_cldr/readme.html"
      }
    ]
  },
  {
    "name": "Code Analysis Tools",
    "items": [
      {
        "name": "Dialyzer",
        "description": "A static analysis tool for Erlang and other languages that compile to BEAM bytecode for the Erlang VM",
        "thumbnail": false,
        "url": "https://hexdocs.pm/dialyxir/Mix.Tasks.Dialyzer.html"
      },
      {
        "name": "Credo",
        "description": "A static code analysis tool for the Elixir language with a focus on teaching and code consistency.",
        "thumbnail": true,
        "url": "https://hexdocs.pm/credo/overview.html"
      }
    ]
  },
  {
    "name": "Other Tools",
    "items": [
      {
        "name": "Ash Framework",
        "description": "A declarative, resource-oriented application development framework for Elixir.",
        "thumbnail": true,
        "url": "https://hexdocs.pm/ash/readme.html"
      },
      {
        "name": "Oban",
        "description": "A robust job processing library for Elixir, providing background job processing with reliability and concurrency.",
        "thumbnail": true,
        "url": "https://hexdocs.pm/oban/Oban.html"
      },
      {
        "name": "Exq",
        "description": "An Elixir library for job processing, utilizing Redis for managing job queues and worker processes.",
        "thumbnail": false,
        "url": "https://hexdocs.pm/exq/readme.html"
      },
      {
        "name": "ExDoc",
        "description": "A tool for generating HTML documentation for Elixir projects, transforming documentation into readable web pages.",
        "thumbnail": false,
        "url": "https://hexdocs.pm/ex_doc/0.22.0/readme.html"
      },
      {
        "name": "LiveBook",
        "description": "A collaborative and interactive code notebook for Elixir, providing a rich environment for exploring and sharing code.",
        "thumbnail": true,
        "url": "https://hexdocs.pm/livebook/readme.html"
      },
      {
        "name": "Telemetry",
        "description": "A lightweight library for dynamic dispatching of events, with a focus on metrics and instrumentation.",
        "thumbnail": false,
        "url": "https://hexdocs.pm/telemetry/readme.html"
      }
    ]
  }
]
